Revit 2024 API
RebarContainer.AppendItemFromCurvesAndShape Method
 Appends an Item to the RebarContainer. Fills its data on base of the Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public RebarContainerItem AppendItemFromCurvesAndShape(
	RebarShape rebarShape,
	RebarBarType barType,
	RebarHookType startHook,
	RebarHookType endHook,
	XYZ normal,
	IList<Curve> curves,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient
)
Visual Basic
Public Function AppendItemFromCurvesAndShape ( _
	rebarShape As RebarShape, _
	barType As RebarBarType, _
	startHook As RebarHookType, _
	endHook As RebarHookType, _
	normal As XYZ, _
	curves As IList(Of Curve), _
	startHookOrient As RebarHookOrientation, _
	endHookOrient As RebarHookOrientation _
) As RebarContainerItem
Visual C++
public:
RebarContainerItem^ AppendItemFromCurvesAndShape(
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	RebarHookType^ startHook,
	RebarHookType^ endHook,
	XYZ^ normal,
	IList<Curve^>^ curves,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient
)
Parameters
rebarShape
Type: Autodesk.Revit.DB.Structure.RebarShape
 A RebarShape element that defines the shape of the rebar. A RebarShape element matches curves and hooks. A RebarShape element provides RebarStyle of the rebar.
barType
Type: Autodesk.Revit.DB.Structure.RebarBarType
 A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook
Type: Autodesk.Revit.DB.Structure.RebarHookType
 A RebarHookType element that defines the hook for the start of the bar. If this parameter is null, it means to create a rebar with no hook.
endHook
Type: Autodesk.Revit.DB.Structure.RebarHookType
 A RebarHookType element that defines the hook for the end of the bar. If this parameter is null, it means to create a rebar with no hook.
normal
Type: Autodesk.Revit.DB.XYZ
 The normal to the plane that the rebar curves lie on.
curves
Type: System.Collections.Generic.IList<Curve>
 An array of curves that define the shape of the rebar curves. They must belong to the plane defined by the normal and origin. Bends and hooks should not be included in the array of curves.
startHookOrient
Type: Autodesk.Revit.DB.Structure.RebarHookOrientation
 Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal. Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
endHookOrient
Type: Autodesk.Revit.DB.Structure.RebarHookOrientation
 Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal. Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
Return Value
 The Rebar Container Item.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input curves is empty. -or- The input curves contains at least one curve which is not a bound Line or bound Arc and is not supported for this operation. -or- curves do not form a valid CurveLoop. -or- The input curves contains at least one helical curve and is not supported for this operation. -or- The rebarShape has End Treatments
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  normal has zero length. -or- A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  curves contains non-fillet arcs with radii that are less than the minimum bend radius for the RebarBarType and RebarShape style.
Autodesk.Revit.Exceptions.InvalidOperationException |  rebarShape does not match curves.
See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace